In [1]:
pwd

'/home/david/PyProjects/SciPi2016'

In [2]:
ls

ClimateData.ipynb  kaggle_example.ipynb  pandas_tutorial/

In [29]:
import pandas as pd

data_dictionary={
    
    "Apples" : ["7","8","7","90","90"],
    
    "Bananas" : ["8","3","8","7","34"]
}

data_Lists =[
    
    { "Apples" : 27,"Bananas" : 89 },
    { "Apples" : 47,"Bananas" : 99 },
    { "Apples" : 57,"Bananas" : 79 }
]

## data dicyionay to dataframe
df=pd.DataFrame(data_dictionary)
df2=pd.DataFrame(data_Lists)

In [30]:
df2

   Apples  Bananas
0      27       89
1      47       99
2      57       79

In [25]:
df.columns=['Test1','Test2']

df

  Test1 Test2
0     7     8
1     8     3
2     7     8
3    90     7
4    90    34

In [31]:
df2

   Apples  Bananas
0      27       89
1      47       99
2      57       79

In [34]:
df2['year'] = ['Sales 2015',' Sales 2016','Sales 2017']

In [35]:
df2

   Apples  Bananas         year
0      27       89   Sales 2015
1      47       99   Sales 2016
2      57       79   Sales 2017

In [52]:
type(df2.set_index('year'))

pandas.core.frame.DataFrame

In [60]:
df2

             Apples  Bananas
year
Sales 2015       27       89
 Sales 2016      47       99
Sales 2017       57       79

ValueError: labels ['year'] not contained in axis

In [39]:
series1=pd.Series(['Flour','Milk','Egg','Spam'])

In [40]:
series1

0    Flour
1     Milk
2      Egg
3     Spam
dtype: object

In [41]:
series2=pd.Series(['2 Cups','4cups','6','90'])

In [ ]:
#https://www.packtpub.com/mapt/book/big_data_and_business_intelligence/9781787123137/3/ch03lvl1sec22/creating-a-series

In [42]:
series2

0    2 Cups
1     4cups
2         6
3        90
dtype: object

In [43]:
series1.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
series1.values

array(['Flour', 'Milk', 'Egg', 'Spam'], dtype=object)

In [45]:
series2.index = series1.values

In [46]:
series2

Flour    2 Cups
Milk      4cups
Egg           6
Spam         90
dtype: object

In [47]:
#new way of doing the index, Challange accepted.....

a = pd.DataFrame({'Apples': [35,41],'Bananas': [21,34]}, index = ['2017 Sales', '2018 Sales'])

In [48]:
a

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [61]:
#look at that,quite cool...
Dinner = pd.Series(['4 cups', '1 cup', '2 large', '1 can'], index = ['Flour', 'Milk', 'Eggs', 'Spam'])

Dinner

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
dtype: object

In [62]:
#check_q4(pd.read_csv("../input/wine-reviews/winemag-data_first150k.csv",  index_col = 0))

q6_df = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]}, index=['Year 1', 'Year 2'])

In [63]:
q6_df

        Cows  Goats
Year 1    12     22
Year 2    20     19